from re import T


list1 = [1,2,3,4,5]
print( list1 )

성적 = [95,70,25,100,63]
print ( 성적 )

list = [ 1,5,3,6 ]
print (list[2:4])

list = [ 1, 5, 3, 6]
print (list[1:3])
print (list[2:])
print (list[:2])
print (list[1])

length = len(list)
print(length) 

list = []
print(list)

과목 = [ '국어' , '수학' , '영어' , '과학' ]
print(과목)

무지개 = [ '빨' , '주' , '노' , '초' ,  '파' , '남' , '보']
첫번째색 = 무지개 [0]
print(' 무지개의 첫번째 색은 {}이다'. format(첫번째색))

무지개 = [ '빨' , '주' , '노' , '초' ,  '파' , '남' , '보']
마지막색 = 무지개 [6]
print(' 무지개의 첫번째 색은 {}이다'. format(마지막색))

list1= [1,2,3]
list2= [4,5,6]
list3= list1 + list2

print(list3)

동물 =  [ '강아지' , '고양이' , '새' , '곰' ,  '코끼리']
식물 = [ '소나무' , '벚꽃' , '단풍나무' , '장미' ]
생물 = 동물 + 식물
print (생물)
#생물 곱하기 삼
print(생물*2)

list = [1,2,3]
list[1] = 10
print(list)

동물 =  [ '강아지' , '고양이' , '새' , '곰' ,  '코끼리']
동물.append('사람')
print(동물)


동물 =  [ '강아지' , '고양이' , '새' , '곰' ,  '코끼리']
동물.insert(3,'돼지')
print(동물)


동물 =  [ '강아지' , '고양이' , '새' , '곰' ,  '코끼리']
del 동물 [1]
print(동물)

동물 =  [ '강아지' , '고양이' , '새' , '곰' ,  '코끼리']
동물.remove('고양이')
print(동물)


list = []
print(list)


영화 =  [ '아바타' , '어벤져스' , '타이타닉' , '명량' ,  '겨울왕국']
영화.append('겨울왕국2')
print(영화)

영화 =  [ '아바타' , '어벤져스' , '타이타닉' , '명량' ,  '겨울왕국2']
영화.insert(4,'겨울왕국')
print(영화)


영화 =  [ '아바타' , '어벤져스' , '타이타닉' , '명량' ,  '겨울왕국2']
del 영화 [1]
print(영화)

영화 =  [ '아바타' , '어벤져스' , '타이타닉' , '명량' ,  '겨울왕국2']
영화.remove('어벤져스')
print(영화)

lang1 = ["C", "C++", "JAVA"]
lang2 = ["Python", "Go", "C#"]
langs = lang1 + lang2
print(langs)

tuple= ()
print(tuple)

무지개 = ('빨' , '주' , '노' , '초' ,  '파' , '남' , '보')
첫번째색 = 무지개 [0]
print(' 무지개의 첫번째 색은 {}이다'. format(첫번째색))

무지개 = ('빨' , '주' , '노' , '초' ,  '파' , '남' , '보')
마지막색 = 무지개 [6]
print(' 무지개의 첫번째 색은 {}이다'. format(마지막색))

영화 =  ( '아바타' , '어벤져스' , '타이타닉' , '명량' ,  '겨울왕국2')
print(영화)

t = (1,2,3,4,5,6,7,8,9,10)
print(t*10)

t = (1,2,3,4,5,6,7,8,9,10)
t2 = t * 10
print(t2)
print(len(t2))

#여기부터 추가문제 까르르르르ㅡㄹ르ㅡ

tuple= ()
print(tuple)


영화 =  ( '아바타' , '어벤져스' , '타이타닉' , '명량' ,  '겨울왕국2')
print(영화)

# ㅅ = (1,2,3)
# ㅅ[0] = 'a'

t = 1,2,3,4

data = int ( input("1,2,3을 입력 :"))
t = ('주먹', '가위', '보')
