dic ={}
print(dic)

dic = {'이름': '허유진', '나이': 13, '성별':'여성','생일':'11월 4일'}
print(dic)

ice = {"메로나": 1000, "비비빅": 1200, "빵빠레": 1800}
ice["죠스바"] = 1200
ice["월드콘"] = 1500
print(ice)
print("메로나 가격:", ice["메로나"])
ice["메로나"] = 1300
print(ice)

del ice["메로나"]
print(ice)

ice = {"메로나": [1000,20],
"비비빅": [1200,3],
"죠스바": [1800,100]}
print(ice)

ice = {"메로나": [1000,20],
"비비빅": [1200,3],
"죠스바": [1800,100]}
print (ice["메로나"][0], "원")
print (ice["메로나"][1], "개")
ice["월드콘"] = [500,7]
print(ice)

days = { ' 1월' : 31, '2월 ' : 28,'3월' : 31}
print(days)
days['2월 '] = 29
print(days)

data = input("숫자 입력 :")
한글변환 = {'1': '일','2': '이','3': '삼','4': '사','5': '오','6': '육','7': '칠','8': '팔','9': '구'}
print(한글변환[data])

def 힌글변환함수(num):
    한글변환 = {'1' : 'one '}






A = set([2,1,3,5,7,10,100,283])

B = set([3,4,1,6,22,100,302])

print(A&B)

print(A|B)

print(A-B)
print(B-A)
